app/Controllers/Home.php

SELECT *
FROM `produk`
SELECT *
FROM `kategoriproduk`
---
    public function index(): string
    {

        $produkModel = new ProdukModel();
        $data = $produkModel->findAll();

        $kategoriModel = new KategoriProdukModel();
        $dataKatgeori = $kategoriModel->findAll();