app/Controllers/KategoriProduk.php

    public function kategoriProduk():string
    {

        $kategoriModel = new KategoriProdukModel();
        $data = $kategoriModel->findAll();
---
SELECT *
FROM `kategoriproduk`