app/Libraries/AdminLibrary.php

INSERT INTO `admin` (`idAdmin`, `nama`, `username`, `password`) VALUES ('Admin202412230722449108', 'thoriq', 'thoriq', '$2y$10$b41KLUKWLqzCmJmB0d7ITeF37fVxY.nwcrlHtwdvG6RdE8V8Zr.XO')
---
    public function tambahAdmin(string $nama, string $username, string $password): bool
    {
        $adminModel = new AdminModel();

        if (empty($nama) || empty($username) || empty($password)) {

            return false;
        } else {

            $tanggal = date('YmdHis');
            $randomNumber = rand(1000, 9999);
            $idAdmin = 'Admin' . $tanggal . $randomNumber;

            $password = password_hash($password, PASSWORD_DEFAULT);

            $data = [
                'idAdmin' => $idAdmin,
                'nama' => $nama,
                'username' => $username,
                'password' => $password
            ];

            $adminModel->insert($data);

SELECT *
FROM `admin`
WHERE `username` = 'thoriq'
 LIMIT 1
---
    public function loginAdmin(string $username, string $password): bool
    {

        $adminModel = new AdminModel();

        if (empty($username) || empty($password)) {

            return false;
        } else {

            $cekUsername = $adminModel->where('username', $username)->first();